#+ todo(w) 区域节点 插入连线

# todo 特殊情况: 选择了两个没连线的节点, 是区域输入和输出
# todo 目前只有一个转接点才能插入, 如果是两个转接点就不能任意插入了
# todo 但是起点终点多个同高优先级, 如果有区域输入出, 或者位置在边界那就是它了
# todo 只选了节点框, 框内节点没全选, 插入到连线会有问题
# todo 不应删旧线, 应设INVALID, 如Geo接口添加了采样编号
# todo 如果鼠标在边界框内, 应该选距离鼠标最近的线
# todo 节点偏移量改进
# todo 遍历连线时排除选中的连线
# todo 是否有更简单的凸包算法, 线段和凸包是否相交
# todo 支持多输入的话还要考虑不要造成循环线
# todo(w) 插入连线,
# 如果连线是向左下走的, 节点向下偏移不合适?
# 插入连线时可能的话更改数据类型?
# 移动节点过程中 按某个键 可以无视现有连线插入到别的连线里, 替换主连线, 保持次要连线
# 改进带扩展接口节点的插入, 比如烘焙, 材质节点添加的重复区域
# 输出接口隐藏的话还要考虑吗?
# 现在是找到输入输出的主接口, 根据优先级, 并不好,
# 应该是先找到输出的主接口, 然后再输入里找到匹配的(不一定是最高优先级), 这样也不对, 比如采样编号
# todo ctrl x 后连线不应消失


# todo 隐藏接口的问题
# todo 从预设新添加节点可能不符合目前的规则(已连线接口在选中里,不符合)
# todo const 修饰问题

# todo 已连线能允许插入吗?
# todo 非几何数据/最高优先级,已连线允许插入吗?

# ===============================================================================================
# ===============================================================================================
# ===============================================================================================

# todo 节点编辑器路径导航: 材质里点击顶层会崩
